---
type: Glazing
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 7
tags: [revit-api, class]
---

# Glazing

`Autodesk.Revit.DB.Visual.Glazing` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | GlazingColorByObject | 2018.1 | `public static string GlazingColorByObject { get ; }` |
| Property | GlazingNoLevels | 2018.1 | `public static string GlazingNoLevels { get ; }` |
| Property | GlazingReflectance | 2018.1 | `public static string GlazingReflectance { get ; }` |
| Property | GlazingTransmittanceColor | 2018.1 | `public static string GlazingTransmittanceColor { get ; }` |
| Property | GlazingTransmittanceMap | 2018.1 | `public static string GlazingTransmittanceMap { get ; }` |